DanielR92/CMT2300A/RP2040/main.cpp
    if(0x02 != spi3w.readReg(0x09))
        spi3w.writeReg(0x09, 0x02);

    spi3w.writeReg(CMT2300A_CUS_IO_SEL, 0x20); // -> GPIO3_SEL[1:0] = 0x02

    // interrupt 1 control selection to TX DONE
    if(CMT2300A_INT_SEL_TX_DONE != spi3w.readReg(CMT2300A_CUS_INT1_CTL))
        spi3w.writeReg(CMT2300A_CUS_INT1_CTL, CMT2300A_INT_SEL_TX_DONE);

    // select interrupt 2
    if(0x07 != spi3w.readReg(CMT2300A_CUS_INT2_CTL))
        spi3w.writeReg(CMT2300A_CUS_INT2_CTL, 0x07);

    // interrupt enable (TX_DONE, PREAM_OK, SYNC_OK, CRC_OK, PKT_DONE)
    spi3w.writeReg(CMT2300A_CUS_INT_EN, 0x3B);

    spi3w.writeReg(0x41, 0x48);
    spi3w.writeReg(0x42, 0x5A);
    spi3w.writeReg(0x43, 0x48);
    spi3w.writeReg(0x44, 0x4D);
    spi3w.writeReg(0x64, 0x64);

    if(0x00 == spi3w.readReg(CMT2300A_CUS_FIFO_CTL))
        spi3w.writeReg(CMT2300A_CUS_FIFO_CTL, 0x02); // FIFO_MERGE_EN

    if(!cmtSwitchStatus(CMT2300A_GO_SLEEP, CMT2300A_STA_SLEEP))
        Serial.println("warn: not switched to sleep mode!");

    #ifdef RP2040
        sleep_us(95);
    #else
        delayMicroseconds(95);
    #endif

    freqSetting(0, false);
    spi3w.writeReg(0x22, 0x20);
    spi3w.writeReg(0x23, 0x20);
    spi3w.writeReg(0x24, 0xD2);
    spi3w.writeReg(0x25, 0x35);
    spi3w.writeReg(0x26, 0x0C);
    spi3w.writeReg(0x27, 0x0A);
    spi3w.writeReg(0x28, 0x9F);
    spi3w.writeReg(0x29, 0x4B);
    spi3w.writeReg(0x27, 0x0A);

    if(!cmtSwitchStatus(CMT2300A_GO_STBY, CMT2300A_STA_STBY))
        Serial.println("warn: not switched to standby mode!");

    spi3w.writeReg(0x03, 0x1D);
    spi3w.writeReg(0x5C, 0x8A);
    spi3w.writeReg(0x5D, 0x18);

    if(!cmtSwitchStatus(CMT2300A_GO_SLEEP, CMT2300A_STA_SLEEP))
        Serial.println("warn: not switched to sleep mode!");

    if(!cmtSwitchStatus(CMT2300A_GO_STBY, CMT2300A_STA_STBY))
        Serial.println("warn: not switched to standby mode!");
}

//-----------------------------------------------------------------------------
void setup() {
    Serial.begin(115200);
    cnt        = 0;
    mStartFreq = 0x00;
    mEndFreq   = 0x22;
    mLastFreq  = mStartFreq;
    mDec = 0;
    mFound     = false;
    spi3w.setup();

    memset(mRec, 0xcc, 10 * 32);
    mRecId = 0;
    mLastRecId = 0;
    mRetransmits = 5;

    delay(1000);
    Serial.println("start");

    spi3w.writeReg(0x00, 0xff);
    delay(20);

    resetCMT();

    mPrevMillis = millis();
}

//-----------------------------------------------------------------------------
void loop() {
    if ((millis() - mPrevMillis) > 1000) {
        mPrevMillis = millis();
        cnt++;

        if(!mFound) {
        //if(!mFound || (mLastFreq != 0)) {
            if((cnt < 5) || ((cnt % 2) == 0)) {
                uint8_t cfg1[15] = {
                    0x56, U32_B3(wr), U32_B2(wr), U32_B1(wr), U32_B0(wr), U32_B3(dtu), U32_B2(dtu), U32_B1(dtu),
                    U32_B0(dtu), 0x02, 0x15, 0x21, 0x0c, 0x14, 0x00
                };

                /**
                 * 0x0c: 863.00 MHz
                 * 0x0d: 863.24 MHz
                 * 0x0e: 863.48 MHz
                 * 0x0f: 863.72 MHz
                 * 0x10: 863.96 MHz
                 * */
                txData(cfg1, 15, false, true);
                for(uint8_t i = 0; i < 8; i++)
                    checkRx();
                txData(cfg1, 15, false, true);
            }
        }

        if((cnt >= 5)) { //((ts % 2) == 0) &&
            uint8_t rqst[27] = {
                0x15, U32_B3(wr), U32_B2(wr), U32_B1(wr), U32_B0(wr), U32_B3(dtu), U32_B2(dtu), U32_B1(dtu),
                U32_B0(dtu), 0x80, 0x0B, 0x00, U32_B3(ts), U32_B2(ts), U32_B1(ts), U32_B0(ts),
                0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
                0x00, 0x00, 0x00
            };
            txData(rqst, 27);
        }
        ts++;
    }
    checkRx();
}
